{
  "ProType": {
    "TempId": 1,
    "ProfileName": "RiftWalker",
    "HitDie": "1d4",
    "RpgClass": "Wizard",
    "Level": 1,
    "XpValue": 259.0,
    "HpValue": 4,
    "HpMax": 0,
    "Proficiency": 3,
    "Ac": 13,
    "Skills": [
      "Survival",
      "Stealth"
    ],
    "Strength": {
      "Score": 14,
      "Bonus": 3,
      "Saving": 3
    },
    "Dexterety": {
      "Score": 15,
      "Bonus": 4,
      "Saving": 3
    },
    "Constitution": {
      "Score": 13,
      "Bonus": 2,
      "Saving": 2
    },
    "Intelligince": {
      "Score": 13,
      "Bonus": 0,
      "Saving": 2
    },
    "Wisdom": {
      "Score": 14,
      "Bonus": 2,
      "Saving": 2
    },
    "Charisma": {
      "Score": 10,
      "Bonus": 1,
      "Saving": 1
    },
    "SpellCardsV": [
      {
        "CardName": "Alarm",
        "Level": "1st-Level",
        "School": "Abjuration",
        "CastingTime": "1 minute",
        "Range": "30 feet",
        "Components": "V, S, M",
        "Materials": "A tiny bell and a piece of fine silver wire.",
        "Duration": "8 hours",
        "Description": "You set an alarm against unwanted intrusion. Choose a door, a window, or an area within Range that is no larger than a 20-foot cube. Until the spell ends, an alarm alerts you whenever a Tiny or larger creature touches or enters the warded area. When you cast the spell, you can designate creatures that won’t set off the alarm. You also choose whether the alarm is mental or audible.A mental alarm alerts you with a ping in your mind if you are within 1 mile of the warded area. This ping awakens you if you are sleeping.An audible alarm produces the sound of a hand bell for 10 seconds within 60 feet.",
        "AtHigherLevels": null,
        "Catagory": "Ranger, Ritual Caster, Wizard",
        "Concentration": false,
        "Ritual": true
      },
      {
        "CardName": "Conjure Animals",
        "Level": "3rd-Level",
        "School": "Conjuration",
        "CastingTime": "1 action",
        "Range": "60 feet",
        "Components": "V, S",
        "Materials": null,
        "Duration": "Up to 1 hour",
        "Description": "You summon fey spirits that take the form of beasts and appear in unoccupied spaces that you can see within Range. Choose one of the following options for what appears:- One beast of challenge rating 2 or lower- Two beasts of challenge rating 1 or lower- Four beasts of challenge rating 1/2 or lower- Eight beasts of challenge rating 1/4 or lower- Each beast is also considered fey, and it disappears when it drops to 0 hit points or when the spell ends.The summoned creatures are friendly to you and your companions. Roll initiative for the summoned creatures as a group, which has its own turns. They obey any verbal commands that you issue to them (no action required by you). If you don’t issue any commands to them, they defend themselves from hostile creatures, but otherwise take no actions.The DM has the creatures’ statistics.",
        "AtHigherLevels": "When you cast this spell using certain higher-Level spell slots, you choose one of the summoning options above, and more creatures appear: twice as many with a 5th-Level slot, three times as many with a 7th-Level.",
        "Catagory": "Druid, Ranger",
        "Concentration": true,
        "Ritual": false
      }
    ]
  }
}